{
	"actors": {
		"mayor": [
			{	
				"id": 0,
				"name": "EntranceDialogueMain",
				"speaker": "mayor",
				"type": "linearDialogue", 
				"script_en_GB": [
					"Oh my God! I’m so glad you’re here!",
					"We’ve got so many terrible problems here on Dome Island, we really need your help!",
					"The air is full of horrible fumes, the plants and animals are sick and dying, there’s rubbish everywhere and ...",
					"...I’m sorry, where are my manners!?",
					"My name is Diana and I’m the Mayor of the little village just north of here.",
					"Anyway, it’s really good to meet you, but you had really better get going! There’s a lot to do!",
					"I know that Ethan needs you for something.",
					"Why don’t you head straight over to the BEACH west of here. You’ll find him at his SURF SHACK."

				],
				"nextId": 1

			},
			{
				"id": 1,
				"name":	"EntranceDialogueStub", 
				"speaker": "mayor",
				"type": "linearDialogue",
				"script_en_GB": [
					"Head over to see Ethan at his SURF SHACK on the BEACH west of here.",
					"I know he needs your help with something."
				],
				"nextId": 1 
			}
		],

		"surfShackOwner": [
			{
				"id": 0,
				"name": "FirstMeetingMain",
				"speaker": "surfShackOwner",
				"type": "branchDialogue",
				"script_en_GB": [
					"Hi there, I’m Ethan and this is my Surf Shack.",
					"This is where everyone on the island comes for their surfing gear, beach equipment and snacks and all that.",
					".. Or it would be, but now the beach is in such a terrible state, fewer and fewer people are coming down here.",
					"Except me… It’s terrible for business, but worse than that, the beach is completely disgusting.",
					"There’s rubbish everywhere, I don’t know where it all comes from, but plenty of it is from everyone just leaving old food and junk lying on the beach when they leave.",
					"Something’s got to be done! Will you help me?"
				],
				"yesNextId": 1, 
				"noNextId": 3
			},

			{
				"id": 1,
				"name": "FirstMeetingYes",
				"speaker": "surfShackOwner",
				"type": "linearDialogue", 
				"script_en_GB": [
					"That's fantastic! Thanks so much!!",
					"Now, I’ve been working on a good way to collect all this rubbish, quickly and safely",
					"I mean, you don’t want to cut your hand on some rusty can or get covered in melted ice cream do you?",
					"So here, take this rubbish picker and this backpack, you can store quite a lot of rubbish in there and when it is full, bring it back and we’ll find something to do with it."
				],
				"nextId": 2
			},

			{
				"id": 2,
				"name": "FirstMeetingGameStart",
				"speaker": "surfShackOwner",
				"type": "linearDialogue", 
				"script_en_GB": [
					"Now you've got what you need,",
					"so come back when you've filled up that bag!"
				],
				"nextId": 2
				
			},

			{
				"id": 3,
				"name": "FirstMeetingNo",
				"speaker": "surfShackOwner",
				"type": "linearDialogue",
				"script_en_GB": [
					"Oh, alright then... well speak to me again if you change your mind"
				],
				"nextId": 4
			},

			{
				"id": 4,
				"name": "FirstMeetingStub",
				"speaker": "surfShackOwner",
				"type": "branchDialogue",
				"script_en_GB": [
					"Hi again, I'm glad you came back",
					"Can you help me get rid of some of the rubbish all over my beach?"
				],
				"yesNextId": 1, 
				"noNextId": 3
			}	
		],
		"playerThoughtBubbles": [
			{
				"id":0,
				"name": "rubbishBlockingPath1",
				"speaker": "player",
				"type": "linearDialogue",
				"script_en_GB": [
					"This huge smelly pile of rubbish is in the way!"
				],
				"nextId": 0
			},
			{
				"id":1,
				"name": "rubbishBlockingPath2",
				"speaker": "player",
				"type": "linearDialogue",
				"script_en_GB": [
					"Eugh! I'm not climbing over all that rubbish!"
				],
				"nextId": 1
			}
		]

	}
}